In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect("worksheet.db")

In [3]:
def qry(QUERRY):
    return pd.read_sql(QUERRY, conn)

In [4]:
pd.read_sql("SELECT * from sqlite_master", conn)

,type,name,tbl_name,rootpage,sql
0,table,hydrants,hydrants,2,"CREATE TABLE ""hydrants"" (\n""year"" INTEGER,\n ..."
1,table,trees,trees,3,"CREATE TABLE ""trees"" (\n""tree"" TEXT,\n ""x"" IN..."
2,table,species,species,4,"CREATE TABLE ""species"" (\n""code"" TEXT,\n ""spe..."

In [5]:
hydrants = qry("SELECT * FROM hydrants")
trees = qry("SELECT * FROM trees")
species = qry("SELECT * FROM species")

In [6]:
trees

  tree   x  y species  diameter  priority
0    A  10  4       m         8        71
1    B  20  4       m        10       100
2    C  30  4       p         6        30
3    D  40  4       p         8        40
4    E  50  4       m        12        99

### 1a. *Without* running this cell - *predict* the output of the following statement

In [8]:
trees[trees["priority"] > 90][["x", "y"]]

    x  y
1  20  4
4  50  4

### 1b. *Convert* the statement to an equivalent *SQL* querry.

In [7]:
qry("""
SELECT x,y
FROM trees
WHERE priority>90
""")

    x  y
0  20  4
1  50  4

----
### 2a. *Predict* the output of the following *SQL* querry

In [10]:
qry("SELECT x+y FROM trees WHERE species = 'm'")

   x+y
0   14
1   24
2   54

### 2b. *Convert* the querry into an equivalent *pandas* statement.

In [27]:
trees[trees["species"] == "m"]["x"] + trees[trees["species"] == "m"]["y"]

0    14
1    24
4    54
dtype: int64

In [30]:
cd = species["code"][species["species"]=="maple"].iloc[0]
trees[trees["species"] == cd]["tree"]
# cd = m
# A B E

0    A
1    B
4    E
Name: tree, dtype: object

### 3b. *Convert* the statements into an equivalent *SQL* querry.

In [38]:
qry("""
SELECT tree
FROM trees
WHERE species="{}"
""".format(cd))

  tree
0    A
1    B
2    E

----
### 4a. *Predict* the output of the following querry

In [34]:
qry("SELECT species FROM trees ORDER BY priority DESC")
# m
# m
# m
# p
# p

  species
0       m
1       m
2       m
3       p
4       p

### 4.b *Convert* the querry code to *Pandas*

In [45]:
trees.sort_values("priority", ascending=False)["species"]

1    m
4    m
0    m
3    p
2    p
Name: species, dtype: object

----
### 5a. *Predict* the output of the following code

In [46]:
list(qry("SELECT tree, priority FROM trees ORDER BY priority DESC LIMIT 1").iloc[0])
# [100]

['B', 100]

### 5.b *Convert* the above code to *Pandas*

In [62]:
# [trees.sort_values("priority", ascending=False).iloc[0]["tree"], trees.sort_values("priority", ascending=False).iloc[0]["priority"]]
trees.sort_values("priority", ascending=False)[ ["tree", "priority"] ].iloc[0].to_list()

['B', 100]

----
### 6a. *Predict* the output of the following code

In [63]:
qry("""SELECT COUNT(SPECIES) AS c1,
COUNT(DISTINCT SPECIES) as c2
FROM trees""")

# 5 3
# cant count lmfaooo

   c1  c2
0   5   2

### 6b. *Convert* the above code to *Pandas*

In [78]:
pd.DataFrame([ {"c1":len(trees["species"]), "c2":len(trees["species"].value_counts() )} ])

   c1  c2
0   5   2

----
### 7a. *Predict* the output of the following code

In [79]:
qry("""SELECT species, COUNT(SPECIES) AS count,
AVG(diameter) AS size
FROM trees
GROUP BY species ORDER BY count DESC""")

  species  count  size
0       m      3  10.0
1       p      2   7.0

### 7b. *Convert* the above code to *Pandas*

----
# Additional Exercises: 
### *Predict* the output of the following statements

In [15]:
# qry("SELECT color, year FROM hydrants WHERE color = 'blue' ")

In [16]:
# df = qry("SELECT color, year FROM hydrants")
# df[df.color == "blue"]

In [17]:
# qry("SELECT year FROM hydrants WHERE owner='private' AND active")

In [18]:
# df = qry("SELECT year, style, active FROM hydrants")
# df[df.active == 1]["style"]

In [19]:
# hydrants["color"].value_counts()

In [20]:
# qry("""SELECT color, COUNT(*) FROM hydrants
# WHERE active GROUP BY color""")

In [21]:
# qry("""SELECT color, COUNT(*) AS count FROM hydrants
# GROUP BY color HAVING count > 1""")

In [22]:
# qry("""SELECT color, COUNT(*) AS count
# FROM hydrants WHERE year >= 2000
# GROUP BY color HAVING count < 2""")